espressif/esp-idf/components/soc/esp32s2beta/include/soc/rmt_struct.h
            uint32_t mem_tx_wrap_en: 1;                 /*when data need to be send is more than channel's mem can store  then set this bit to enable reuse of mem this bit is used together with reg_rmt_tx_lim_chn.*/
            uint32_t reserved2:     30;
        };
        uint32_t val;
    } apb_conf;
    union {
        struct {
            uint32_t ch0:        1;
            uint32_t ch1:        1;
            uint32_t ch2:        1;
            uint32_t ch3:        1;
            uint32_t ch4:        1;
            uint32_t ch5:        1;
            uint32_t ch6:        1;
            uint32_t ch7:        1;
            uint32_t en:         1;
            uint32_t reserved9: 23;
        };
        uint32_t val;
    } tx_sim;
    union {
        struct {
            uint32_t ch0:             1;
            uint32_t ch1:             1;
            uint32_t ch2:             1;
            uint32_t ch3:             1;
            uint32_t ch4:             1;
            uint32_t ch5:             1;
            uint32_t ch6:             1;
            uint32_t ch7:             1;
            uint32_t reserved8:      24;
        };
        uint32_t val;
    } ref_cnt_rst;
    union {
        struct {
            uint32_t ch0_tx_loop:         1;
            uint32_t ch1_tx_loop:         1;
            uint32_t ch2_tx_loop:         1;
            uint32_t ch3_tx_loop:         1;
            uint32_t ch4_tx_loop:         1;
            uint32_t ch5_tx_loop:         1;
            uint32_t ch6_tx_loop:         1;
            uint32_t ch7_tx_loop:         1;
            uint32_t reserved8:          24;
        };
        uint32_t val;
    } int1_raw;
    union {
        struct {
            uint32_t ch0_tx_loop:        1;
            uint32_t ch1_tx_loop:        1;
            uint32_t ch2_tx_loop:        1;
            uint32_t ch3_tx_loop:        1;
            uint32_t ch4_tx_loop:        1;
            uint32_t ch5_tx_loop:        1;
            uint32_t ch6_tx_loop:        1;
            uint32_t ch7_tx_loop:        1;
            uint32_t reserved8:         24;
        };
        uint32_t val;
    } int1_st;
    union {
        struct {
            uint32_t ch0_tx_loop:         1;
            uint32_t ch1_tx_loop:         1;
            uint32_t ch2_tx_loop:         1;
            uint32_t ch3_tx_loop:         1;
            uint32_t ch4_tx_loop:         1;
            uint32_t ch5_tx_loop:         1;
            uint32_t ch6_tx_loop:         1;
            uint32_t ch7_tx_loop:         1;
            uint32_t reserved8:          24;
        };
        uint32_t val;
    } int1_ena;
    union {
        struct {
            uint32_t ch0_tx_loop:         1;
            uint32_t ch1_tx_loop:         1;
            uint32_t ch2_tx_loop:         1;
            uint32_t ch3_tx_loop:         1;
            uint32_t ch4_tx_loop:         1;
            uint32_t ch5_tx_loop:         1;
            uint32_t ch6_tx_loop:         1;
            uint32_t ch7_tx_loop:         1;
            uint32_t reserved8:          24;
        };
        uint32_t val;
    } int1_clr;
    uint32_t date;                                      /**/
} rmt_dev_t;
extern rmt_dev_t RMT;

typedef struct {
    union {
        struct {
            uint32_t duration0 :15;
            uint32_t level0 :1;
            uint32_t duration1 :15;
            uint32_t level1 :1;
        };
        uint32_t val;
    };
} rmt_item32_t;

typedef struct {
    union {
        struct {
            uint16_t duration :15;
            uint16_t level :1;
        };
        uint16_t val;
    };
} rmt_item16_t;

//Allow access to RMT memory using RMTMEM.chan[0].data32[8]
typedef volatile struct {
    struct {
        union {
            rmt_item32_t data32[64];
            rmt_item16_t data16[128];
        };
    } chan[8];
} rmt_mem_t;
extern rmt_mem_t RMTMEM;

#ifdef __cplusplus
}
#endif

#endif  /* _SOC_RMT_STRUCT_H_ */
